app/Controllers/Login_controller.php

    public function login()
    {
        $session = session();
        $usuarioModel = new Usuario();
        $usuario = $this->request->getPost('usuario');
        $password = $this->request->getPost('password');

        $datos = $usuarioModel->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuario`
WHERE `usuario` = 'haberles'
 LIMIT 1