app/Controllers/Usuario_controller.php

    public function index()
    {
        $usuarioModel = new Usuario();
        $datos ['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `usuario`